SELECT COUNT(@@GLOBAL.histogram_step_size_binlog_fsync);
COUNT(@@GLOBAL.histogram_step_size_binlog_fsync)
1
1 Expected
SET @start_global_value = @@GLOBAL.histogram_step_size_binlog_fsync;
SELECT @start_global_value;
@start_global_value
128us
128us Expected
SHOW STATUS LIKE '%Latency_histogram_binlog_fsync_%';
Variable_name	Value
Latency_histogram_binlog_fsync_0-128us	0
Latency_histogram_binlog_fsync_128-384us	0
Latency_histogram_binlog_fsync_384-896us	0
Latency_histogram_binlog_fsync_896-1920us	0
Latency_histogram_binlog_fsync_1920-3968us	0
Latency_histogram_binlog_fsync_3968-8064us	0
Latency_histogram_binlog_fsync_8064-16256us	0
Latency_histogram_binlog_fsync_16256-32640us	0
Latency_histogram_binlog_fsync_32640-65408us	0
Latency_histogram_binlog_fsync_65408-130944us	0
SET @@GLOBAL.histogram_step_size_binlog_fsync='16us';
select @@GLOBAL.histogram_step_size_binlog_fsync;
@@GLOBAL.histogram_step_size_binlog_fsync
16us
16us Expected
select * from information_schema.global_variables where variable_name='histogram_step_size_binlog_fsync';
VARIABLE_NAME	VARIABLE_VALUE
HISTOGRAM_STEP_SIZE_BINLOG_FSYNC	16us
SELECT @@GLOBAL.histogram_step_size_binlog_fsync = VARIABLE_VALUE
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES
WHERE VARIABLE_NAME='histogram_step_size_binlog_fsync';
@@GLOBAL.histogram_step_size_binlog_fsync = VARIABLE_VALUE
1
1 Expected
SELECT COUNT(@@GLOBAL.histogram_step_size_binlog_fsync);
COUNT(@@GLOBAL.histogram_step_size_binlog_fsync)
1
1 Expected
SELECT COUNT(VARIABLE_VALUE)
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES
WHERE VARIABLE_NAME='histogram_step_size_binlog_fsync';
COUNT(VARIABLE_VALUE)
1
1 Expected
SELECT COUNT(@@local.histogram_step_size_binlog_fsync);
ERROR HY000: Variable 'histogram_step_size_binlog_fsync' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SELECT COUNT(@@SESSION.histogram_step_size_binlog_fsync);
ERROR HY000: Variable 'histogram_step_size_binlog_fsync' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SET @@GLOBAL.histogram_step_size_binlog_fsync='32';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of '32'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='0';
select @@GLOBAL.histogram_step_size_binlog_fsync;
@@GLOBAL.histogram_step_size_binlog_fsync
0
0 Expected
SET @@GLOBAL.histogram_step_size_binlog_fsync='ms32';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of 'ms32'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='32ps';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of '32ps'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='3s2';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of '3s2'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='32@s';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of '32@s'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='32s.';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of '32s.'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync='s';
ERROR 42000: Variable 'histogram_step_size_binlog_fsync' can't be set to the value of 's'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.histogram_step_size_binlog_fsync=null;
select @@GLOBAL.histogram_step_size_binlog_fsync;
@@GLOBAL.histogram_step_size_binlog_fsync
NULL
NULL Expected
SET @@GLOBAL.histogram_step_size_binlog_fsync='16.5us';
select @@GLOBAL.histogram_step_size_binlog_fsync;
@@GLOBAL.histogram_step_size_binlog_fsync
16.5us
16.5us Expected
SET @@GLOBAL.histogram_step_size_binlog_fsync = @start_global_value;
SELECT @@GLOBAL.histogram_step_size_binlog_fsync;
@@GLOBAL.histogram_step_size_binlog_fsync
128us
16ms Expected
