SELECT COUNT(@@GLOBAL.innodb_histogram_step_size_log_write);
COUNT(@@GLOBAL.innodb_histogram_step_size_log_write)
1
1 Expected
SET @start_global_value = @@GLOBAL.innodb_histogram_step_size_log_write;
SELECT @start_global_value;
@start_global_value
16us
16us Expected
SET @@GLOBAL.innodb_histogram_step_size_log_write='64ms';
select @@GLOBAL.innodb_histogram_step_size_log_write;
@@GLOBAL.innodb_histogram_step_size_log_write
64ms
64ms Expected
select * from information_schema.global_variables where variable_name='innodb_histogram_step_size_log_write';
VARIABLE_NAME	VARIABLE_VALUE
INNODB_HISTOGRAM_STEP_SIZE_LOG_WRITE	64ms
SELECT @@GLOBAL.innodb_histogram_step_size_log_write = VARIABLE_VALUE
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES
WHERE VARIABLE_NAME='innodb_histogram_step_size_log_write';
@@GLOBAL.innodb_histogram_step_size_log_write = VARIABLE_VALUE
1
1 Expected
SELECT COUNT(@@GLOBAL.innodb_histogram_step_size_log_write);
COUNT(@@GLOBAL.innodb_histogram_step_size_log_write)
1
1 Expected
SELECT COUNT(VARIABLE_VALUE)
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES
WHERE VARIABLE_NAME='innodb_histogram_step_size_log_write';
COUNT(VARIABLE_VALUE)
1
1 Expected
SELECT COUNT(@@local.innodb_histogram_step_size_log_write);
ERROR HY000: Variable 'innodb_histogram_step_size_log_write' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SELECT COUNT(@@SESSION.innodb_histogram_step_size_log_write);
ERROR HY000: Variable 'innodb_histogram_step_size_log_write' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SET @@GLOBAL.innodb_histogram_step_size_log_write='32';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of '32'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='0';
select @@GLOBAL.innodb_histogram_step_size_log_write;
@@GLOBAL.innodb_histogram_step_size_log_write
0
0 Expected
SET @@GLOBAL.innodb_histogram_step_size_log_write='ms32';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of 'ms32'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='32ps';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of '32ps'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='3s2';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of '3s2'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='32@s';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of '32@s'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='32s.';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of '32s.'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write='s';
ERROR 42000: Variable 'innodb_histogram_step_size_log_write' can't be set to the value of 's'
Expected error 'Variable cannot be set to this value';
SET @@GLOBAL.innodb_histogram_step_size_log_write=null;
select @@GLOBAL.innodb_histogram_step_size_log_write;
@@GLOBAL.innodb_histogram_step_size_log_write
NULL
NULL Expected
SET @@GLOBAL.innodb_histogram_step_size_log_write='16.5us';
select @@GLOBAL.innodb_histogram_step_size_log_write;
@@GLOBAL.innodb_histogram_step_size_log_write
16.5us
16.5us Expected
SET @@GLOBAL.innodb_histogram_step_size_log_write = @start_global_value;
SELECT @@GLOBAL.innodb_histogram_step_size_log_write;
@@GLOBAL.innodb_histogram_step_size_log_write
16us
16us Expected
