SET @start_value = @@global.max_db_connections;
SELECT @start_value;
@start_value
0
Display the DEFAULT value of max_db_connections
SET @@global.max_db_connections = 5000;
SET @@global.max_db_connections = DEFAULT;
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
Verify default value of variable
SET @@global.max_db_connections = @start_value;
SELECT @@global.max_db_connections = 151;
@@global.max_db_connections = 151
0
Change the value of max_db_connections to a valid value
SET @@global.max_db_connections = 100000;
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
SET @@global.max_db_connections = 99999;
SELECT @@global.max_db_connections;
@@global.max_db_connections
99999
SET @@global.max_db_connections = 65536;
SELECT @@global.max_db_connections;
@@global.max_db_connections
65536
SET @@global.max_db_connections = 1;
SELECT @@global.max_db_connections;
@@global.max_db_connections
1
SET @@global.max_db_connections = 2;
SELECT @@global.max_db_connections;
@@global.max_db_connections
2
Change the value of max_db_connections to invalid value
SET @@global.max_db_connections = -1;
Warnings:
Warning	1292	Truncated incorrect max_db_connections value: '-1'
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
SET @@global.max_db_connections = 100000000000;
Warnings:
Warning	1292	Truncated incorrect max_db_connections value: '100000000000'
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
SET @@global.max_db_connections = 10000.01;
ERROR 42000: Incorrect argument type to variable 'max_db_connections'
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
SET @@global.max_db_connections = -1024;
Warnings:
Warning	1292	Truncated incorrect max_db_connections value: '-1024'
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
SET @@global.max_db_connections = 0;
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
SET @@global.max_db_connections = 100001;
Warnings:
Warning	1292	Truncated incorrect max_db_connections value: '100001'
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
SET @@global.max_db_connections = ON;
ERROR 42000: Incorrect argument type to variable 'max_db_connections'
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
SET @@global.max_db_connections = 'test';
ERROR 42000: Incorrect argument type to variable 'max_db_connections'
SELECT @@global.max_db_connections;
@@global.max_db_connections
100000
Test if accessing session max_db_connections gives error
SET @@session.max_db_connections = 4096;
ERROR HY000: Variable 'max_db_connections' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.max_db_connections;
ERROR HY000: Variable 'max_db_connections' is a GLOBAL variable
Check if the value in GLOBAL & SESSION Tables matches values in variable
SELECT @@global.max_db_connections = VARIABLE_VALUE 
FROM performance_schema.global_variables 
WHERE VARIABLE_NAME='max_db_connections';
@@global.max_db_connections = VARIABLE_VALUE
1
SELECT @@max_db_connections = VARIABLE_VALUE 
FROM performance_schema.session_variables 
WHERE VARIABLE_NAME='max_db_connections';
@@max_db_connections = VARIABLE_VALUE
1
Check if TRUE and FALSE values can be used on variable
SET @@global.max_db_connections = TRUE;
SELECT @@global.max_db_connections;
@@global.max_db_connections
1
SET @@global.max_db_connections = FALSE;
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
Check if accessing variable with SESSION,LOCAL and without SCOPE points to same session variable
SET @@global.max_db_connections = 5000;
SELECT @@max_db_connections = @@global.max_db_connections;
@@max_db_connections = @@global.max_db_connections
1
Check if max_db_connections can be accessed with and without @@ sign
SET max_db_connections = 6000;
ERROR HY000: Variable 'max_db_connections' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@max_db_connections;
@@max_db_connections
5000
SET local.max_db_connections = 7000;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'local.max_db_connections = 7000' at line 1
SELECT local.max_db_connections;
ERROR 42S02: Unknown table 'local' in field list
SET global.max_db_connections = 8000;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'global.max_db_connections = 8000' at line 1
SELECT global.max_db_connections;
ERROR 42S02: Unknown table 'global' in field list
SELECT max_db_connections = @@session.max_db_connections;
ERROR HY000: Variable 'max_db_connections' is a GLOBAL variable
Cleanup
SET @@global.max_db_connections = @start_value;
SELECT @@global.max_db_connections;
@@global.max_db_connections
0
