SET @start_global_value = @@global.rpl_skip_tx_api;
SELECT @start_global_value;
@start_global_value
0
'#--------------------FN_DYNVARS_063_01-------------------------#'
SET @@global.rpl_skip_tx_api = TRUE;
SET @@global.rpl_skip_tx_api = DEFAULT;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
0
'#--------------------FN_DYNVARS_063_02-------------------------#'
SET @@global.rpl_skip_tx_api = DEFAULT;
SELECT @@global.rpl_skip_tx_api = 'FALSE';
@@global.rpl_skip_tx_api = 'FALSE'
1
Warnings:
Warning	1292	Truncated incorrect DOUBLE value: 'FALSE'
'#--------------------FN_DYNVARS_063_03-------------------------#'
SET @@global.rpl_skip_tx_api = ON;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
1
SET @@global.rpl_skip_tx_api = OFF;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
0
SET @@global.rpl_skip_tx_api = 0;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
0
SET @@global.rpl_skip_tx_api = 1;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
1
SET @@global.rpl_skip_tx_api = TRUE;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
1
SET @@global.rpl_skip_tx_api = FALSE;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
0
'#-------------------FN_DYNVARS_063_04----------------------------#'
SET @@session.rpl_skip_tx_api = 0;
ERROR HY000: Variable 'rpl_skip_tx_api' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.rpl_skip_tx_api;
ERROR HY000: Variable 'rpl_skip_tx_api' is a GLOBAL variable
'#------------------FN_DYNVARS_063_05-----------------------#'
SET @@global.rpl_skip_tx_api = 'ONN';
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of 'ONN'
SET @@global.rpl_skip_tx_api = "OFFF";
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of 'OFFF'
SET @@global.rpl_skip_tx_api = OF;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'OF' at line 1
SET @@global.rpl_skip_tx_api = TTRUE;
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of 'TTRUE'
SET @@global.rpl_skip_tx_api = FELSE;
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of 'FELSE'
SET @@global.rpl_skip_tx_api = -1024;
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of '-1024'
SET @@global.rpl_skip_tx_api = 65536;
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of '65536'
SET @@global.rpl_skip_tx_api = 65530.34;
ERROR 42000: Incorrect argument type to variable 'rpl_skip_tx_api'
SET @@global.rpl_skip_tx_api = test;
ERROR 42000: Variable 'rpl_skip_tx_api' can't be set to the value of 'test'
'#------------------FN_DYNVARS_063_06-----------------------#'
SELECT IF(@@global.rpl_skip_tx_api, "ON", "OFF") = VARIABLE_VALUE 
FROM performance_schema.global_variables
WHERE VARIABLE_NAME='rpl_skip_tx_api';
IF(@@global.rpl_skip_tx_api, "ON", "OFF") = VARIABLE_VALUE
1
SELECT IF(@@session.rpl_skip_tx_api, "ON", "OFF") = VARIABLE_VALUE 
FROM performance_schema.global_variables
WHERE VARIABLE_NAME='rpl_skip_tx_api';
ERROR HY000: Variable 'rpl_skip_tx_api' is a GLOBAL variable
'#---------------------FN_DYNVARS_063_07----------------------#'
SET @@global.rpl_skip_tx_api = TRUE;
SELECT @@rpl_skip_tx_api = @@global.rpl_skip_tx_api;
@@rpl_skip_tx_api = @@global.rpl_skip_tx_api
1
'#---------------------FN_DYNVARS_063_08----------------------#'
SET @@global.rpl_skip_tx_api = TRUE;
SELECT @@rpl_skip_tx_api;
@@rpl_skip_tx_api
1
SELECT local.rpl_skip_tx_api;
ERROR 42S02: Unknown table 'local' in field list
SELECT session.rpl_skip_tx_api;
ERROR 42S02: Unknown table 'session' in field list
SELECT rpl_skip_tx_api = @@session.rpl_skip_tx_api;
ERROR 42S22: Unknown column 'rpl_skip_tx_api' in 'field list'
SET @@global.rpl_skip_tx_api = @start_global_value;
SELECT @@global.rpl_skip_tx_api;
@@global.rpl_skip_tx_api
0
